class TextTypes:
    GREET = "{name}, Вас приветствует медицинский помощник в области определения ментальных и инфраорбитальных отверстий!"
    MENU = "📍Главное меню"
    EXEC_IMAGE = "Обработка изображения"
    INPUT_IMG = "Загрузите изображение"
    INPUT_EXIT = "Чтобы выйти из диалога нажмите на кнопку ниже"
    SUCCESSFUL_IMAGE_LOAD = "Изображение успешно загружено!"
    UNSUCCESSFUL_IMAGE_LOAD = "Пожалуйста, отправьте одно изображение"
    UNSUCCESSFUL_AUTH = (
        "🔒Требуется авторизация. Отправьте токен:\n"
        "/auth ТОКЕН\n"
    )
    AUTH_INPUT_TOKEN = "Введите токен:"
    AUTH_COMPLETE = "✅Авторизация успешна"
    WRONG_TOKEN = "❌Токен не найден"